#+title: Day1
#+property: header-args

** run
#+name: run pth1.c
#+begin_src bash :results output :exports both
./pth1.out
#+end_src

#+RESULTS: run pth1.c
: Hello, World

** run
#+begin_src bash :results output :exports both
./a.out
#+end_src
#+RESULTS:
: starting task1
: starting task2
: ending task1
: ending task2
** run
#+begin_src bash :results output :exports both
./nthreads.out
#+end_src

#+RESULTS:
#+begin_example
starting task
starting task
starting task
starting task
starting task
starting task
starting task
starting task
starting task
starting task
ending task
ending task
ending task
ending task
ending task
ending task
ending task
ending task
ending task
ending task
#+end_example

** run
#+begin_src bash :results output :exports both
./a.out
#+end_src

#+RESULTS:
#+begin_example
starting task1
starting task1
starting task1
starting task1
starting task1
starting task1
starting task1
starting task1
starting task1
starting task1
starting task2
starting task2
starting task2
starting task2
starting task2
starting task2
starting task2
starting task2
starting task2
starting task2
ending task1
ending task1
ending task1
ending task1
ending task1
ending task1
ending task1
ending task1
ending task2
ending task1
ending task2
ending task1
ending task2
ending task2
ending task2
ending task2
ending task2
ending task2
ending task2
ending task2
#+end_example
